app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("description", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Singing cartoon lobster"], ["name", "Sebastian"], ["created_at", "2016-05-04 23:40:03.388861"], ["updated_at", "2016-05-04 23:40:03.388861"]]
---
  def create
    Creature.create creature_params

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
---
  def edit
    @creature = Creature.find params[:id]
    @tags = Tag.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @creature = Creature.find params[:id]

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Small, orange fish often kept as a pet, in glass bowls"], ["updated_at", "2016-05-05 01:31:18.821365"], ["id", 1]]
---
  def update
    creature = Creature.find params[:id]
    creature.update creature_params

DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 6]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 6]]
---
  def destroy
    Creature.find(params[:id]).delete